In [8]:
#1
import pandas as pd
x = [8,7,9,4]
n = pd.Series(x,index = ['x','r','t','y'])
n

x    8
r    7
t    9
y    4
dtype: int64

In [9]:
#2
date = pd.date_range(start = '5-1-2021',end = '5-12-2021')
date

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [10]:
#3
vehicles = {'cars':['bmw','benz','volvo','jaguar'],
           'bike':['KTM','FZ','RC','R15']}
new_data = pd.DataFrame(vehicles)
new_data

  bike    cars
0  KTM     bmw
1   FZ    benz
2   RC   volvo
3  R15  jaguar

In [11]:
#4
x = [[2,4,5,6],[5,7,89,5]]
dd = pd.DataFrame(x)
dd

   0  1   2  3
0  2  4   5  6
1  5  7  89  5

In [12]:
#5
df = pd.read_csv('new.csv')
dg = pd.DataFrame(df)
dg

    name  mark  calories
0  basil    25       120
1   arun    30       202
2   amal    26       302
3  athul    23       120

In [13]:
#6
ss = dg.sort_values(['name','calories'])
ss

    name  mark  calories
2   amal    26       302
1   arun    30       202
3  athul    23       120
0  basil    25       120

In [14]:
#7
details = {'name':['Arun','Amal','Ajay','Varun'],
        'age':[21,22,23,21]}
index = {'a','b','c','d'}
new = pd.DataFrame(details,index)
print(new)
print('\n')
new.reset_index(inplace = True,drop = True)
new

   age   name
b   21   Arun
d   22   Amal
c   23   Ajay
a   21  Varun

   age   name
0   21   Arun
1   22   Amal
2   23   Ajay
3   21  Varun

In [15]:
#8
details = {'name':['Arun','Amal','Ajay','Varun'],
        'age':[21,22,23,21]}
det = pd.DataFrame(details)       
print(det)
print('\n After selecting 1st two rows')
print(det.loc[[0,1]])

   age   name
0   21   Arun
1   22   Amal
2   23   Ajay
3   21  Varun

 After selecting 1st two rows
   age  name
0   21  Arun
1   22  Amal

In [16]:
#9
data = {'Name':['Arun','Ram','Sita','Rocky','Don','Basha','Dhoni','Boss'],
       'Occupation':['Farmer','Army','Teacher','Farmer','Teacher','Army','Army','Teacher'],
       'Salary':[20000,50000,35000,25000,25000,40000,45000,36000]}
dt = pd.DataFrame(data)
print(dt)
print('\n')
dt.groupby('Occupation').mean()

    Name Occupation  Salary
0   Arun     Farmer   20000
1    Ram       Army   50000
2   Sita    Teacher   35000
3  Rocky     Farmer   25000
4    Don    Teacher   25000
5  Basha       Army   40000
6  Dhoni       Army   45000
7   Boss    Teacher   36000

            Salary
Occupation
Army         45000
Farmer       22500
Teacher      32000

In [17]:
#10
import numpy as np
new_det = {'Name':['Arun','Amal','Ajay','Varun'],
        'Age':[21,np.nan,23,np.nan]}
ttt = pd.DataFrame(new_det)
print(ttt)
print('\n After filling with 0')
print('\n')
ttt['Age'] = ttt['Age'].fillna(0)
print(ttt)

    Age   Name
0  21.0   Arun
1   NaN   Amal
2  23.0   Ajay
3   NaN  Varun

 After filling with 0


    Age   Name
0  21.0   Arun
1   0.0   Amal
2  23.0   Ajay
3   0.0  Varun

In [18]:
#11

c_data = pd.read_csv('company.csv')

print(c_data)

print()

c_data['profit'] = c_data['profit'].apply(lambda x:x>0)

print(c_data)

  Company_name  profit
0        Bajaj   10000
1          Tcs  -12000
2      sunitha   52000
3     Saravana   45000

  Company_name  profit
0        Bajaj    True
1          Tcs   False
2      sunitha    True
3     Saravana    True

In [19]:
#12
empdata = pd.read_csv('employee.csv')
companydata = pd.read_csv('companydata.csv')

print(empdata)

print()

print(companydata)
print()

df = pd.merge(empdata, companydata, how ='inner',on='eid')
df

   eid ename  stipend
0    1  Arun    12000
1    2  Amal    15000
2    3  Abhi     6000
3    4  Amar    10000

   eid        designation
0    1             intern
1    2  software engineer
2    3          developer
3    4              clerk

   eid ename  stipend        designation
0    1  Arun    12000             intern
1    2  Amal    15000  software engineer
2    3  Abhi     6000          developer
3    4  Amar    10000              clerk